app/controllers/products_controller.rb

  def index
    @products = Product.paginate(page: params[:page], per_page: 10).with_attached_image.includes(:categories)
---
SELECT "products".* FROM "products"
SELECT COUNT(*) FROM "products"

  def search
    @search = params[:search]
    @filter = params[:filter]
    @products = @filter == '' ? Product.all : Product.where("age_limit <= ?", @filter.to_i)
    @products = @products.where("title LIKE '%#{params[:search]}%' OR body LIKE '%#{params[:search]}%'").paginate(page: params[:page], per_page: 10).with_attached_image.includes(:categories)
---
SELECT "products".* FROM "products" WHERE (title LIKE '%an%' OR body LIKE '%an%') LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT "products".* FROM "products" WHERE "products"."title" = ?  [["title", "\"123\""]]
SELECT COUNT(*) FROM "products" WHERE "products"."title" = ?  [["title", "\"123\""]]

  def product
    @product ||= Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]