app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 2]]